สรุป lec

ชื่อตัวแปร
-ควรประกอบด้วยตัวอักขระและตัวเลข ตัวแรกต้องเป็นอักขระ
-ตัวพิมพ์ใหญ่ตัวพิมพ์เล็กถือว่าต่างกัน

การตั้งชื่อ
-ควรอ่านเข้าใจง่าย
-เราใช้หลักการตั้งชื่อตัวแปรนี้ในการตั้งชื่อฟังก์ชั่นได้ด้วย

ประเภทข้อมูลและขนาด
-ประเภทข้อมูลที่ใช้เก็บเลขจำนวนเต็ม
  char = 1 bytes
  int = 4 bytes
  float = 4 bytes
  double = 8 bytes

-สามารถใช้ sizeof ในการตรวจสอบหาคะแนนได้
-void มักจะใช้กรณีของการนิยามฟังก์ชันที่ไม่มีการส่งค่ากลับไปยังผู้เรียก

ค่าคงที่ของเลขฐาน 2, ฐาน 8 และ ฐาน16
-ตัวเลข 0 แล้วตามตัวเลขจำนวนเต็มคือเลขฐาน 8
-0x หรือ 0X จะบ่งบอกถึงเลขฐาน 16
 
รูปแบบการปริ้นเลขฐาน 8 และ 16 
- ใช้ %o สำหรับฐาน 8
-ใช้ %x สำหรับฐาน 16



#include<stdio.h>
#define bb "asdfgh" //ดูให้ดีว่าชื่อเหมือนฟังก์ชั่นไหม
int main(){
    printf("hello, world\n");
    long long int a = 4000000000; 
    unsigned int b = 400000000; //unsigned int เก็บ 0 - 4294967296
    printf("%lld", a); unsigned long long เก็บได้มากสุด
    printf("%u", b);

    char c = 'a';
    char d = 97;
    printf("%c %d %c %d" , d , d , c ,c);

    float f = 0.1245;
    double e = 20.18888;
    printf("%f %lf" , f , e);


    float j;
    printf("%f" , j+1000); // ต้องกำหนดค่าตัวแปรก่อนใช้งานเสมอ

    char p[] = "ABC"; //char array
    printf("%10s" , p); 

    char r[0]; //complier กำหนดrเป็นemply string

    char r = '\0';

}